### Ali Abid

Task 1: Series

In [19]:
import pandas as pd

# Series

In [20]:
countries = {
    "Pakistan": 2100000,
    "Afghanistan":100000,
    "Iran": 1200000,
    "Turkye": 1500000,
    "Qatar": 300000,
    "Palastine": 100000,
}

s1 = pd.Series(countries)
s1

Pakistan       2100000
Afghanistan     100000
Iran           1200000
Turkye         1500000
Qatar           300000
Palastine       100000
dtype: int64

# Data Frame

In [21]:
employees = {
    "Name": ["Zahid", "Adam", "Sara", "Neha", "Rabia"],
    "Department": ["Human Resource", "Marketing", "Development", "Management", "Quality Assurence"],
    "Expereience years": [4,2,5,1,3],
    "Salary in PKR": [300000, 250000, 350000, 140000, 210000],
}

df = pd.DataFrame(employees)
df

    Name         Department  Expereience years  Salary in PKR
0  Zahid     Human Resource                  4         300000
1   Adam          Marketing                  2         250000
2   Sara        Development                  5         350000
3   Neha         Management                  1         140000
4  Rabia  Quality Assurence                  3         210000

### Calculation Bonus (15% of Salary)

In [25]:
bonus_salaries = list(df["Salary in PKR"]*15/100)
bonus_salaries

[45000.0, 37500.0, 52500.0, 21000.0, 31500.0]

### Bonus Column

In [35]:
df["Bonus"] = bonus_salaries
df

    Name         Department  Expereience years  Salary in PKR    Bonus
0  Zahid     Human Resource                  4         300000  45000.0
1   Adam          Marketing                  2         250000  37500.0
2   Sara        Development                  5         350000  52500.0
3   Neha         Management                  1         140000  21000.0
4  Rabia  Quality Assurence                  3         210000  31500.0

### Filtered

In [37]:
df_filtered = df[df['Expereience years'] > 3]
df_filtered

    Name      Department  Expereience years  Salary in PKR    Bonus
0  Zahid  Human Resource                  4         300000  45000.0
2   Sara     Development                  5         350000  52500.0

### Sorted

In [38]:
df_sorted = df.sort_values(by="Salary in PKR", ascending=False)
df_sorted

    Name         Department  Expereience years  Salary in PKR    Bonus
2   Sara        Development                  5         350000  52500.0
0  Zahid     Human Resource                  4         300000  45000.0
1   Adam          Marketing                  2         250000  37500.0
4  Rabia  Quality Assurence                  3         210000  31500.0
3   Neha         Management                  1         140000  21000.0